<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft Office 2016 SKU-less installer package.</string>
    <key>Identifier</key>
    <string>com.github.yohan460-recipes.download.InTuneCompanyPortal</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>InTune Company Portal</string>
        <key>ID</key>
        <string>55770</string>        
        <key>DOWNLOAD_URL_BASE</key>
        <string>https://www.microsoft.com/en-us/download/confirmation.aspx?id=</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL_BASE%%ID%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>