<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download and package the Intune Company Portal and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.yohan460-recipes.jss.IntuneCompanyPortal</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Intune Company Portal</string>
            <key>CATEGORY</key>
            <string>Applications</string>
            <key>POLICY_CATEGORY</key>
            <string>Testing</string>
            <key>POLICY_TEMPLATE</key>
            <string>PolicyTemplate.xml</string>
            <key>SELF_SERVICE_ICON</key>
            <string>IntuneCompanyPortal.png</string>
            <key>POSTINSTALL_SCRIPT</key>
            <string>Intune_Company_Portal_Permissions.sh</string>
            <key>POSTINSTALL_SCRIPT_TEMPLATE</key>
            <string>PostInstallScript.xml</string>
            <key>GROUP_TEMPLATE</key>
            <string>SmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>%NAME%-update-smart</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>Intune Company Portal is the frontend software of the Microsoft Intune management software and necessary for JAMF and Intune integration.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.yohan460-recipes.pkg.IntuneCompanyPortal</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>scripts</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%POSTINSTALL_SCRIPT%</string>
                            <key>filename</key>
                            <string>%POSTINSTALL_SCRIPT%</string>
                            <key>template_path</key>
                            <string>%POSTINSTALL_SCRIPT_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
