<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Company Portal and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.yohan460-recipes.pkg.CompanyPortal</string>
    <key>Input</key>
    <dict>
        <key>APP_FILENAME</key>
        <string>CompanyPortal</string>
        <key>BUNDLE_ID</key>
        <string>com.microsoft.CompanyPortal-</string>
        <key>NAME</key>
        <string>Company Portal</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.yohan460-recipes.download.CompanyPortal</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
